IDENTIFICATION DIVISION.
PROGRAM-ID. INSERT-EMPLOYEE.

DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 EMPLOYEE-NAME     PIC X(30).
        01 EMPLOYEE-SURNAME  PIC X(30).
        01 EMPLOYEE-EMAIL    PIC X(30).
        01 EMPLOYEE-AGE      PIC 9(3).

PROCEDURE DIVISION.

    MAIN-PROCEDURE.

        MOVE "Iker" TO EMPLOYEE-NAME.
        MOVE "Lobo Pérez" TO EMPLOYEE-SURNAME.
        MOVE "iloboiac@gmail.com" TO EMPLOYEE-EMAIL.
        MOVE 43 TO EMPLOYEE-AGE.

        DISPLAY "Nombre de Empleado: " EMPLOYEE-NAME
        DISPLAY "Apellidos: " EMPLOYEE-SURNAME
        DISPLAY "Email: " EMPLOYEE-EMAIL
        DISPLAY "Edad: " EMPLOYEE-AGE.

    STOP RUN.